* 日本語プログラミング開発計画メモ 2014-10-06 中鉢
** 開発方針
*** 言語開発の流れブーターの開発方針
   - ブーターをJava 等で使る
   - 後は全部日本語で作る方法をとる

*** 評価
   - 日本語なら私も書いてみたい
   - コーディング能力が高くない人に書いてもらう
*** ネーミング
   - 言霊でいいのか
* タイルスクリプトのアプローチ

- 関連研究
  - [[http://ieeexplore.ieee.org/xpl/articleDetails.jsp?reload=true&arnumber=4459482][IEEE Xplore Abstract - Toward A More Scalable End-User Scripting Language]]
  - [[http://ci.nii.ac.jp/naid/110009660234][CiNii 論文 -  ビジュアル-Java相互変換によるシームレスな言語移行を指向したプログラミング学習環境の提案と評価]]

- OpenBlocks
  - [[http://dspace.mit.edu/handle/1721.1/41550][DSpace@MIT: OpenBlocks : an extendable framework for graphical block programming systems]]
  - [[http://education.mit.edu/openblocks][Open Blocks Download Page | MIT STEP]]
  - [[https://github.com/mikaelhg/openblocks][mikaelhg/openblocks]]

* 修士論文のアプローチ
** 正規表現を用いたインタープリター

*** 日本語による表現
トマトとりんごの値段を合計する

*** パース
正規表現でプログラムをパース

*** 意味
Rubyで記述

** 成功例

#+begin_src ruby
input = "トマトとりんごの値段を合計する"
pattern = %r{(?<o1>.*)と(?<o2>.*)の(?<f1>.*)を(?<v1>.*する)}
result = pattern.match(input)
p result[:o1], result[:o2], result[:f1], result[:v1]
#+end_src

#+RESULTS:
| トマト | りんご | 値段 | 合計する |

** 失敗例

#+begin_src ruby
input = "しおとさとうの値段を合計する"
pattern = %r{(?<o1>.*)と(?<o2>.*)の(?<f1>.*)を(?<v1>.*する)}
result = pattern.match(input)
p result[:o1], result[:o2], result[:f1], result[:v1]
#+end_src

#+RESULTS:
| しおとさ | う | 値段 | 合計する |

** 解決方法
   - 辞書を用いる
     - 変数定義時に辞書に登録し，この情報を用いてパースする
     - 「しお」と「さとう」は分離しないようにする

* 課題
** 具象文法における括弧の扱い
  - 手続きの定義方法
    − （＜オブジェクト＞と＜オブジェクト＞）を＜・・・する＞
** テキストのパース
   - そもそもテキストをパースする必要があるのか？
   - 構造エディタ（structure editor）を利用する？
     - [[http://en.wikipedia.org/wiki/Structure_editor][Structure editor - Wikipedia, the free encyclopedia]]
     - タイルスクリプトのGUIエディタもstructure editor

* COMMENT
*** 2013-07-24 日本語プログラミング言語

**** 単語
配列 Array
   辞書，索引 Hash

   Rubyで外部DSLとして作成する
   [[http://d.hatena.ne.jp/keyesberry/20110605/p1][Sinatraに別構文があってもいいじゃないか！ - hp12c]]
**** 概念を辞書に投稿するとIDができる
     :PROPERTIES:
     :ID:       o2b:fa742253-a749-45a3-a760-42b75f7b9168
     :POST_DATE: [2013-12-28 土 15:32]
     :POSTID:   16
     :BLOG:     blog.chubachi.net
     :END:
     概念構築に基づくプログラミング

     1. 「加算」という概念を辞書に登録する
     2. 辞書からIDが反る
     3. IDを指定して「Add」を登録する
     4. IDを指定して意味を登録する
**** 日本語でspecを書く
（テスターが）　？？を与えたら，　（プログラムが）　？？を返す．

*** 2014-01-17 金曜日
**** 日本語プログラミングで使う大和言葉
Entered on [2014-01-16 木 22:44]
  「〜を呼ぶ」 call -> わかりづらい？行くじゃだめ？

  「〜から戻りました」「抜ける」 return
  [[file:~/.emacs.d/init.org::*%E3%83%91%E3%83%83%E3%82%B1%E3%83%BC%E3%82%B8%E3%81%AE%E5%88%9D%E6%9C%9F%E8%A8%AD%E5%AE%9A][パッケージの初期設定]]

**** 日本語プログラミング言語
  - 議論する
  - 動かして見せてほしい
  - エディタ
  - 未踏
  - テキストでやる意味はあるか
  - 時代遅れではないか
**** [[http://web.sfc.keio.ac.jp/~okadaken/TurtleCafeForKotodama2010/TurtleCafe/][Turtle　Cafe]]
Entered on [2014-01-19 日 19:47]

  [[file:~/Dropbox/Note/journal.org::*%E6%97%A5%E6%9C%AC%E8%AA%9E%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0%E8%A8%80%E8%AA%9E][日本語プログラミング言語]]

**** 2014-01-25 土曜日
***** 日本語プログラミング言語
作成日 [2014-01-25 土 13:42]

 Format -> 整形する

